/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
                            global.h
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

#ifndef 	_ORGANGS_KEYBOARD_H_
#define 	_ORGANGS_KEYBOARD_H_

/************************************************************************/
/*                          Macros Declaration                          */
/************************************************************************/
#define 	KB_IN_BYTES 		32		/* 键盘输入缓冲区大小 */

typedef struct s_kb
{
	char* 	p_head;	 				/* 指向缓冲区中下一个空闲位置 */
	char* 	p_tail;					/* 指向键盘任务应处理的字节 */
	int 	count;					/* 缓冲区共有多少字节 */
	char 	buf[KB_IN_BYTES];		/* 缓冲区 */
}KB_INPUT;

#endif
